In [3]:
import pandas as pd

df=pd.read_csv('shopping.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Id       20 non-null     int64
 1   Gender   20 non-null     object
 2   Country  20 non-null     object
 3   Amount   20 non-null     int64
 4   Visits   20 non-null     int64
dtypes: int64(3), object(2)
memory usage: 928.0+ bytes

In [4]:
gc=df.groupby('Country')
gc.groups

{'KSA': [0, 1, 2, 3, 4, 5, 6], 'Kuwait': [15, 16, 17, 18, 19], 'UAE': [7, 8, 9, 10, 11, 12, 13, 14]}

In [5]:
gc.get_group('KSA')

   Id Gender Country  Amount  Visits
0   1      M     KSA    1500       4
1   2      M     KSA    2000       5
2   3      M     KSA    3000       6
3   4      F     KSA    2000       1
4   5      F     KSA    1000       2
5   6      M     KSA    1500       3
6   7      M     KSA    2000       4

In [18]:
gc=df.groupby(['Country','Gender'])
for name,group in gc:
    print(name)
    print(group)

('KSA', 'F')
   Id Gender Country  Amount  Visits
3   4      F     KSA    2000       1
4   5      F     KSA    1000       2
('KSA', 'M')
   Id Gender Country  Amount  Visits
0   1      M     KSA    1500       4
1   2      M     KSA    2000       5
2   3      M     KSA    3000       6
5   6      M     KSA    1500       3
6   7      M     KSA    2000       4
('Kuwait', 'F')
    Id Gender Country  Amount  Visits
15  16      F  Kuwait    1500       5
18  19      F  Kuwait    2000       3
19  20      F  Kuwait    1000       2
('Kuwait', 'M')
    Id Gender Country  Amount  Visits
16  17      M  Kuwait    2000       5
17  18      M  Kuwait    3000       6
('UAE', 'F')
    Id Gender Country  Amount  Visits
9   10      F     UAE    1000       5
12  13      F     UAE    3000       1
14  15      F     UAE    1000       4
('UAE', 'M')
    Id Gender Country  Amount  Visits
7    8      M     UAE    3000       6
8    9      M     UAE    2000       7
10  11      M     UAE    1500       3
11  12      M     UAE    2000       2
13  14      M     UAE    2000       2

In [20]:
counts=df.groupby('Country')['Id'].count()
counts

Country
KSA       7
Kuwait    5
UAE       8
Name: Id, dtype: int64

In [22]:
gc=df.groupby(['Country','Gender'])['Id'].count()
gc

Country  Gender
KSA      F         2
         M         5
Kuwait   F         3
         M         2
UAE      F         3
         M         5
Name: Id, dtype: int64

In [24]:
gc=df.groupby(['Country'])['Amount'].agg('mean')
gc

Country
KSA       1857.142857
Kuwait    1900.000000
UAE       1937.500000
Name: Amount, dtype: float64

In [26]:
gc=df.groupby(['Country']).agg(Amount_mean=('Amount','mean'),Sum_Visits=('Visits','sum'))
gc

         Amount_mean  Sum_Visits
Country
KSA      1857.142857          25
Kuwait   1900.000000          21
UAE      1937.500000          30

In [29]:
gc=df.groupby(['Country']).agg(Sum_Amount=('Amount','sum'),Sum_Visits=('Visits','sum'))
gc.sort_values(by=['Sum_Amount'],ascending=False)

         Sum_Amount  Sum_Visits
Country
UAE           15500          30
KSA           13000          25
Kuwait         9500          21